#+TITLE: Dirty duck: A triage's guided tour
#+AUTHOR: Center of Data Science for Public Policy
#+EMAIL: adolfo@uchicago.edu
#+STARTUP: showeverything
#+STARTUP: nohideblocks
#+PROPERTY: header-args:sql :engine postgresql
#+PROPERTY: header-args:sql+ :dbhost 0.0.0.0
#+PROPERTY: header-args:sql+ :dbport 5434
#+PROPERTY: header-args:sql+ :dbuser food_user
#+PROPERTY: header-args:sql+ :dbpassword some_password
#+PROPERTY: header-args:sql+ :database food
#+PROPERTY: header-args:sql+ :results table drawer
#+PROPERTY: header-args:shell     :results drawer
#+PROPERTY: header-args:ipython   :session food_inspections



* Data

** Downloading

   #+BEGIN_SRC shell
     curl "https://data.cityofchicago.org/api/views/4ijn-s7e5/rows.csv?accessType=DOWNLOAD" > data/inspections.csv
   #+END_SRC

   #+RESULTS:

   We can check the size of the data set

   #+BEGIN_SRC sh :dir /docker:root@tutorial_bastion:/ :results raw drawer
     ls -lh /data
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   total 188M
   -rw-rw-r-- 1 1000 1000 160K Sep 26 02:33 Average_Daily_Traffic_Counts.csv
   -rw-rw-r-- 1 1000 1000 4.7K Sep 26 02:32 Average_Daily_Traffic_Counts_-_Map.csv
   -rw-rw-r-- 1 1000 1000 378K Aug 20 01:52 Boundaries - ZIP Codes.zip
   -rw-rw-r-- 1 1000 1000 845K Aug 20 23:45 CTA_BusStops.zip
   -rw-rw-r-- 1 1000 1000  40K Aug 20 23:46 CTA_RailLines.zip
   -rw-rw-r-- 1 1000 1000  18K Aug 20 23:46 CTA_RailStations.zip
   -rw-rw-r-- 1 1000 1000 335K Aug 20 23:45 CTA_Routes.zip
   -rw-rw-r-- 1 1000 1000  51K Sep 26 02:30 Chicago Public Schools - School Locations SY1415.zip
   -rw-rw-r-- 1 1000 1000 2.6K Aug 20 23:46 PoliceStationsDec2012.zip
   -rw-rw-r-- 1 1000 1000 186M Dec 11 23:01 inspections.csv
   :END:

   And the (apparent) total number of rows

   #+BEGIN_SRC shell :dir data
     wc -l inspections.csv
   #+END_SRC

   #+RESULTS:
   : 395152 inspections.csv


** Loading data to the database
   Assuming that you are already inside =bastion=, run the following

   #+BEGIN_SRC sh :dir /docker:root@tutorial_bastion:/ :results raw drawer
     psql ${FOOD_DB_URL} -c 'select count(*) from inspections'
   #+END_SRC

   #+RESULTS:
   :RESULTS:
    count
   -------
        0
   (1 row)

   :END:

   (If you are connected to the database, you could just type =select count(*) from inspections=

   #+BEGIN_SRC sh :dir /docker:root@tutorial_bastion:/
     psql ${FOOD_DB_URL} -c "\copy inspections FROM '/data/inspections.csv' WITH HEADER CSV"
   #+END_SRC

   #+RESULTS:
   : COPY 162039


   This is different to the number of rows that we calculated
   previously. The reason is that the columns =violations= contains
   several lines in some examples. But don't worry, the previous
   command took care about that.

   Let's glimpse the data

   #+BEGIN_SRC sh :dir /docker:root@tutorial_bastion:/ :results org drawer
     psql ${FOOD_DB_URL} -c 'select * from inspections limit 5'
   #+END_SRC

   #+RESULTS:
   :RESULTS:
    inspection |           dba_name           |           aka_name           | license_num | facility_type |     risk      |        address         |  city   | state |  zip  |    date    |          type           |     results     |                                                                                                                                                                                                                                                                  violations                                                                                                                                                                                                                                                                  |      latitude      |     longitude      |                 location
   ------------+------------------------------+------------------------------+-------------+---------------+---------------+------------------------+---------+-------+-------+------------+-------------------------+-----------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------+--------------------+------------------------------------------
    2116932    | RUBY'S SOULFOOD              | RUBY'S SOULFOOD              |     2542983 | Restaurant    | Risk 1 (High) | 5638 W CHICAGO AVE     | CHICAGO | IL    | 60651 | 2017-12-08 | Complaint               | No Entry        |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |  41.89494199271389 | -87.76687933825816 | (41.89494199271389, -87.76687933825816)
    2116898    | WOODHAVEN BAR & KITCHEN      | WOODHAVEN BAR & KITCHEN      |     1140463 | Restaurant    | Risk 1 (High) | 712 N CLARK ST         | CHICAGO | IL    | 60654 | 2017-12-08 | Canvass Re-Inspection   | Pass            | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Violation corrected.  | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Violation corrected.  | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Violation corrected.  | 2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: Violation corrected. Reach in cooler ambient air temperature @ 39.9F.  | 41.895303937252244 | -87.63136070486723 | (41.895303937252244, -87.63136070486723)
    2116886    | ORANGE GARDEN RESTAURANT LLC | ORANGE GARDEN RESTAURANT LLC |     1942679 | Restaurant    | Risk 1 (High) | 1942 W IRVING PARK RD  | CHICAGO | IL    | 60613 | 2017-12-08 | Complaint Re-Inspection | Pass            | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: PEST CONTROL AT PREMISES 12-7-17. FOUND NO RAT DROPPINGS AT PREMISES. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FOUND HOLE SEALED WITH CEMENT BY REAR EXIT DOOR.                                                                                                                                        | 41.954276019666246 |  -87.6780332991192 | (41.954276019666246, -87.6780332991192)
    2116831    | HALSTED STREET DELI & BAGEL  | HALSTED STREET DELI & BAGEL  |     2569647 | Restaurant    | Risk 1 (High) | 203 N LA SALLE ST      | CHICAGO | IL    | 60601 | 2017-12-07 | License                 | Pass            |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              | 41.885822047853026 | -87.63230373508567 | (41.885822047853026, -87.63230373508567)
    2116816    | CUBBIE DOGGS                 | CUBBIE DOGGS                 |     1479345 |               | Risk 3 (Low)  | 3523 N CLARK ST        | CHICAGO | IL    | 60657 | 2017-12-07 | Canvass                 | Out of Business |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              | 41.946344654873236 |  -87.6556546794345 | (41.946344654873236, -87.6556546794345)
   (5 rows)

   :END:


   Checking the documentation (located  [[https://data.cityofchicago.org/api/assets/BAD5301B-681A-4202-9D25-51B2CAE672FF?download=true][here]]),

   The meaning of some columns is the following:

   - Risk category of facility:: Each establishment is categorized as
     to its risk of adversely affecting the public’s health, with 1
     being the highest and 3 the lowest. The frequency of
     inspection is tied to this risk, with risk 1 establishments
     inspected most frequently and risk 3 least frequently.

   - Inspection type:: An inspection can be one of the following
     types: canvass, the most    common type of inspection performed
     at a frequency relative to the risk of the   establishment;
     consultation, when the inspection is  done at the request of the
     owner prior to the opening of the establishment; complaint, when
     the inspection is done in    response to a complaint against the
     establishment; license, when the inspection is done    as a
     requirement for the establishment to receive its license to
     operate; suspect food    poisoning, when the inspection is done
     in response to one or more persons claiming to    have gotten ill
     as a result of eating at the establishment (a specific type of
     complaint-   based inspection); task-force inspection, when an
     inspection of a bar or tavern is done.    Re-inspections can
     occur for most types of these inspections and are indicated as
     such.

   -  Results:: An inspection can pass, pass with conditions or
     fail. Establishments receiving a ‘pass’ were found to have no
     critical or serious violations (violation number 1-14 and 15-29,
     respectively). Establishments receiving a ‘pass  with conditions’
     were found to have critical or serious violations, but these were
     corrected during the inspection. Establishments receiving a
     ‘fail’ were found to have critical or serious violations that
     were not correctable during the inspection. An establishment
     receiving a ‘fail’ does not  necessarily mean the establishment’s
     licensed is suspended. Establishments found to be out of business
     or not located are indicated as such.

   - Violations: An establishment can receive one or more of 45
     distinct violations (violation numbers 1-44 and 70). For each
     violation number listed for a given establishment, the
     requirement the establishment must meet in order for it to NOT
     receive a violation is noted, followed by a specific description
     of the findings that caused the violation to be issued.


   From this definitions, we can deduct the following claims:

1. /risk/ is related to the frequency of inspections of type /canvass/.
2. /consultation/ is a compulsory inspections /before/ the facility opens
   (so we can remove it from the data), the same happens with /license/.
3. /complaint/ and /suspect food poisoning/ inspections are triggered by
   the people, /consultation/ is triggered by the owner of the
   facility.
4. /task-force/ occurs against bar or taverns.
5. *Critical violations* are coded between =1-14=, *serious violations*
   between =15-29=. So, we can assume that the violations code =30= and
   onward are /minor/ violations.
6. They are only three possible results of the inspection (plus the
   fact that the facility was not located or out of business).


Let's check that we have *only* three different classifications for the
=risk= of the facility and 5 types of =types= of inspections:

#+BEGIN_SRC sql
  select distinct risk from inspections;
#+END_SRC

#+RESULTS:
:RESULTS:
| risk            |
|-----------------|
| [NULL]          |
| All             |
| Risk 2 (Medium) |
| Risk 1 (High)   |
| Risk 3 (Low)    |
:END:

#+BEGIN_SRC sql
  select distinct type from inspections
#+END_SRC

#+RESULTS:
:RESULTS:
| type                                      |
|-------------------------------------------|
| [NULL]                                    |
| CHANGED COURT DATE                        |
| License Re-Inspection                     |
| CORRECTIVE ACTION                         |
| REINSPECTION OF 48 HOUR NOTICE            |
| Task force liquor inspection 1474         |
| RE-INSPECTION OF CLOSE-UP                 |
| LICENSE                                   |
| sfp/complaint                             |
| TASK FORCE LIQUOR 1474                    |
| Business Not Located                      |
| task force                                |
| Canvass Re-Inspection                     |
| CANVASS RE INSPECTION OF CLOSE UP         |
| Duplicated                                |
| CANVASS SPECIAL EVENTS                    |
| fire complaint                            |
| ADDENDUM                                  |
| Task Force Liquor Catering                |
| POSSIBLE FBI                              |
| License consultation                      |
| error save                                |
| TASKFORCE                                 |
| license task 1474                         |
| out ofbusiness                            |
| RECALL INSPECTION                         |
| Kids Cafe'                                |
| finish complaint inspection from 5-18-10  |
| SPECIAL TASK FORCE                        |
| LICENSE CONSULTATION                      |
| CANVAS                                    |
| TASK FORCE LIQUOR 1470                    |
| License                                   |
| Sample Collection                         |
| REINSPECTION                              |
| TASK FORCE LIQUOR (1481)                  |
| Special Task Force                        |
| TASK FORCE PACKAGE GOODS 1474             |
| SFP RECENTLY INSPECTED                    |
| Pre-License Consultation                  |
| SFP/Complaint                             |
| No Entry                                  |
| LICENSE REQUEST                           |
| CITF                                      |
| License-Task Force                        |
| FIRE/COMPLAIN                             |
| citation re-issued                        |
| Complaint Re-Inspection                   |
| FIRE                                      |
| LIQOUR TASK FORCE NOT READY               |
| Consultation                              |
| Tag Removal                               |
| expansion                                 |
| Complaint-Fire Re-inspection              |
| LIQUOR CATERING                           |
| Recent Inspection                         |
| Complaint-Fire                            |
| Non-Inspection                            |
| NO ENTRY-SHORT COMPLAINT)                 |
| Canvass                                   |
| SFP                                       |
| Special Events (Festivals)                |
| TWO PEOPLE ATE AND GOT SICK.              |
| SFP/COMPLAINT                             |
| CANVASS FOR RIB FEST                      |
| LICENSE TASK FORCE / NOT -FOR-PROFIT CLUB |
| KITCHEN CLOSED FOR RENOVATION             |
| SMOKING COMPLAINT                         |
| Short Form Complaint                      |
| Short Form Fire-Complaint                 |
| O.B.                                      |
| LICENSE CANCELED BY OWNER                 |
| Package Liquor 1474                       |
| LICENSE WRONG ADDRESS                     |
| LICENSE RENEWAL FOR DAYCARE               |
| Suspected Food Poisoning Re-inspection    |
| OWNER SUSPENDED OPERATION/LICENSE         |
| TASK FORCE PACKAGE LIQUOR                 |
| CANVASS/SPECIAL EVENT                     |
| Out of Business                           |
| TASK FORCE NOT READY                      |
| No entry                                  |
| Illegal Operation                         |
| DAY CARE LICENSE RENEWAL                  |
| FIRE COMPLAINT                            |
| LICENSE/NOT READY                         |
| CANVASS                                   |
| license                                   |
| TASTE OF CHICAGO                          |
| TASK FORCE NIGHT                          |
| KIDS CAFE                                 |
| Complaint                                 |
| LICENSE RENEWAL INSPECTION FOR DAYCARE    |
| CLOSE-UP/COMPLAINT REINSPECTION           |
| 1315 license reinspection                 |
| no entry                                  |
| Task Force for liquor 1474                |
| Not Ready                                 |
| TAVERN 1470                               |
| NO ENTRY                                  |
| CANVASS SCHOOL/SPECIAL EVENT              |
| LICENSE DAYCARE 1586                      |
| task force(1470) liquor tavern            |
| HACCP QUESTIONAIRE                        |
| LICENSE TASK FORCE / NOT -FOR-PROFIT CLU  |
| Task Force Liquor 1475                    |
| Suspected Food Poisoning                  |
| OUT OF BUSINESS                           |
| Summer Feeding                            |
:END:

#+BEGIN_SRC  sql
  select distinct results from inspections
#+END_SRC

#+RESULTS:
:RESULTS:
| results              |
|----------------------|
| Fail                 |
| Pass w/ Conditions   |
| Not Ready            |
| No Entry             |
| Out of Business      |
| Business Not Located |
| Pass                 |
:END:

Ok, disheartening. But, that is the reality of /real/ data. In the next
section we will try to clean this mess.


** Transforming the data

   For tackling a Machine Learning problem you need to identify the
   *entities* of your problem domain, and if your problem involves time,
   how those entities change over time.

   In this tutorial, we have two different goals: (1) an *EIS* and
   (2) *prioritize inspections*, the entity in which we are interested in
   both cases is the  /facility/.

   In the *EIS*, as a facility owner or manager, we want to predict if
   the facility under our control is at /risk/ of been inspected in the
   following period of time.

   In the *inspections prioritization*, we want to generate a list of
   facilities which are /likely/ to have some *critical* o *serious*
   violation /given that/ they are inspected.

   Both problems are under the umbrella of the /supervised machine
   learning/ problems. That means that we must need examples that
   specify the *outcome* in which are interested (in the ML jargon this
   is called a /label/).

   The *outcome* is what differ between those two projects. For *EIS* the
   outcome is *inspected*, for *Inspections*, the outcome is *major violation found*.

   One of the golden rules -that will make your life easier- is:

   /You can't change your original data/

   The reason for this is, if you make some mistake, or if you want to
   try a different thing you will always can go back to the beginning and
   start over.

   Let's see the data to figure out how ww  need to be transform it.

   Remember that the data that we have is one inspection per row.

   We will check the result of the inspections:

   #+BEGIN_SRC sql :results table drawer
     select
     results, count(*) as total_number
     from
     inspections
     group by
     results
     order by total_number desc;
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | results              | total_number |
   |----------------------+-------------|
   | Pass                 |       90310 |
   | Fail                 |       29770 |
   | Pass w/ Conditions   |       14507 |
   | Out of Business      |       13773 |
   | No Entry             |        4240 |
   | Not Ready            |         805 |
   | Business Not Located |          60 |
   :END:

   We will remove =Not Ready=, =No Entry=, =Out of Business= and =Business Not Located=
   from the data, and We will only keep all the other options (=Fail=, =Pass w/Condition= and
   =Pass)=.


   We still need to clean the column =type= (it contains several
   variations instead of the seven mentioned in the documentation:
   /canvass/, /complaint/, /license/, /re-inspection/, /task-force/, /consultation/
   and /suspect food poisoning/). For simplicity, we will use /regular
   expressions/ and we will ignore /re-inspection/.


   We will add the following columns in =cleaned.inspections=
   - year
   - month
   - day of week
   - is_weekend
   - week_of_year
   - quarter

   We will remove superfluous spaces and will transform the test to
   uppercase, also, we will clean =risk= and we will convert =location= to a
   real =Point=.

   We will drop the columns =state=, =latitude=, =longitude=, since these are
   redundant.

   We will create a new =schema=

   #+BEGIN_SRC sql
     create schema if not exists cleaned;
   #+END_SRC

   #+RESULTS:

   #+BEGIN_SRC sql :results table drawer :tangle ./src/create_cleaned_inspections_table.sql
     drop table if exists cleaned.inspections cascade;

     create table cleaned.inspections as (
     select
     inspection,
     btrim(results) as results,
     license_num,
     dba_name as facility,
     aka_name as facility_aka,
     facility_type,
     substring(risk from '\((.+)\)') as risk,
     address,
     zip as zip_code,
     btrim(upper(city)) as city,
     substring(btrim(upper(type)) from 'CANVASS|TASK FORCE|COMPLAINT|FOOD POISONING|CONSULTATION|LICENSE') as type,
     date,
     extract(year from date) as year,
     extract(month from date) as month,
     extract(isodow from date) as day_of_week, -- Monday: 1 ... Sunday: 7
     case
     when extract(isodow from date) in (6,7) then TRUE
     else FALSE
     end as is_weekend,
     extract(week from date) as week_of_year,
     extract(quarter from date) as quarter,
     ST_SetSRID(ST_MakePoint(longitude, latitude),4326) as location
     from inspections
     where results in ('Fail', 'Pass', 'Pass w/ Conditions') and license_num is not null
     )
   #+END_SRC

   #+RESULTS:


   You could execute this code using (if you are not connected to the database):

   #+BEGIN_SRC sh :dir /docker:root@tutorial_bastion:/ :results org drawer
     psql ${FOOD_DB_URL} < /code/create_cleaned_inspections_table.sql
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   DROP TABLE
   SELECT 134573
   :END:

   Or, if you are connected to the database

   #+BEGIN_EXAMPLE sql
   \i /code/create_cleaned_inspections_table.sql
   #+END_EXAMPLE


   #+BEGIN_SRC sql :results table
     select count(inspection) from cleaned.inspections;
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   |  count |
   |--------|
   | 134573 |
   :END:


   Let's look closer the column =violations=:

   #+BEGIN_SRC sql :results table drawer
     select violations
     from inspections
     limit 5
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | violations                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                                                                                                                      |                                                                                                                                                                                                                                                                                                                                                                               |                                                                                                                                                                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                                                                                   |                                                                                                                                                                                                       |                                                                                                                                                                                                                                     |                                                                                                                                                                                                             |                                                                                                                                                                                                               |
   |-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
   | 12. HAND WASHING FACILITIES: WITH SOAP AND SANITARY HAND DRYING DEVICES, CONVENIENT AND ACCESSIBLE TO FOOD PREP AREA - Comments: INADEQUATE TOILET FACILITIES ON SITE. INOPERABLE TOILET ON SITE, UNABLE TO USE/OPERATE PROPERLY. NO SOAP OR SANITARY HAND DRYING DEVICE AT EXPOSED HANDSINK IN PREP AREA. INSTD TO PROVIDE AT ALL TIMES. STAFF TOILET ROOM NOT CLEAN, CAT FECES AND CAT LITTER ON FLOOR, SOILED TOILET PAPER ON PILE ON STAFF TOILET ROOM FLOOR. EXTREME FOUL SMELL IN STAFF TOILET ROOM. VIOLATION 7-38-030 CRITICAL. INSTD TO MAINTAIN CLEAN TOILET ROOM AND OPERABLE TOILET FACILITIES. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: MUST ORGANIZE AND MAINTAIN THE STORAGE AREA BY THE FURNACE IN THE REAR PREP AREA, ORGANIZE BEHIND FRONT COUNTER. ORGANIZE WALK-IN COOLER USED FOR STORAGE OF SODA POP.                                                                                                                                                                                                                                                                                                                       |                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                                                                                                                      |                                                                                                                                                                                                                                                                                                                                                                               |                                                                                                                                                                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                                                                                   |                                                                                                                                                                                                       |                                                                                                                                                                                                                                     |                                                                                                                                                                                                             |                                                                                                                                                                                                               |
   |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: CLEAN FLOORS UNDER AROUND AND BEHIND SHELVES, COUNTERS AND , FRONT COUNTER AREA, PREP AREA AND INSIDE OF THE WALK-IN COOLER.                                                                                                                                                                                                                                                                                                                                                         | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: OBSERVED THE STORAGE SHELVES NOT CLEAN IN DRY STORAGE AREA, AND IN REACH IN COOLERS, INSTRUCTED TO CLEAN. ALSO CLEAN AND SANITZE CHEESE CONTAINER FRONT PREP AREA. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED INNER DOOR OF THE SODA MACHINE CRACKED GLASS, INSTRUCTED TO REPLACE.                                                                                                                                                                                                                                                                                                                                                     | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: TOILET ROOM VENTILATION IN POOR REPAIR. INSTD TO REPAIR.                                                         | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: WALLS AND CEILING IN STAFF TOILET ROOM IN POOR REPAIR, GAPS AND HOLES. INSTD TO REPAIR SAME. CEILING ON PREMISES ABOVE FRONT DISPLAY  IN POOR REPAIR, PEELING PAINT, UNEVEN SURFACE. INSTD TO REPAIR. | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: NO CHEMICAL TEST KIT ON SITE FOR SANITIZER AT 3-COMPARTMENT SINK. INSTD TO PROVIDE SAME. VIOLATION 7-38-030 CRITICAL.                                                                                                                                 | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: POTENTIALLY HAZARDOUS FOOD AT IMPROPER TEMPERATURE. COOKED GROUND BEEF AT 90.8F IN HOT HOLDING UNIT. VIOLATION 7-38-005A CRITICAL. PRODUCT VOLUNTARILY DISPOSED OF AND DENATURED AT THIS TIME. APPROX 5LBS. $20 VALUE. VIOLATIONS 7-38-005A CRITICAL. | 13. NO EVIDENCE OF RODENT OR INSECT INFESTATION, NO BIRDS, TURTLES OR OTHER ANIMALS - Comments: LIVE CAT ON SITE, WALKING IN AISLES. VIOLATION 7-38-020 CRITICAL. LIVE ANIMALS ON SITE ARE PROHIBITED.                                                                                                                                                                   | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: FRONT DOOR NOT RODENT PROOF, APPROX 1/2 INCH GAP AT TOP OF DOOR. INSTD TO RODENT PROOF DOOR AND HAVE TIGHT FITTING. LIVE ROACH IN STAFF TOILET ROOM. INSTD TO REMOVE ROACH, CLEAN AND SANITIZE AFFECTED AREAS. VIOLATION 7-38-020 SERIOUS. |                                                                                                                                                                                                       |                                                                                                                                                                                                                                     |                                                                                                                                                                                                             |                                                                                                                                                                                                               |
   | 16. FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION - Comments: FOOD NOT PROTECTED DURING STORAGE, FLY STRIPS WITH DEAD FLIES OVER FOOD PREP/MEAT PREP AREA. INSTD TO USE PROPER PEST CONTROL MEASURES. VIOLATION 7-38-005A SERIOUS                                                                                                                                                                                                                                                                                                                                         | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: OVER 10 LIVE HOUSE FLIES AND 25 LIVE FRUIT FLIES NOTED IN MEAT PREP AREA. MICE DROPPINGS (OVER 100) NOTED ON THE FLOOR AND SHELVES IN REAR STORAGE AREAS, BASEMENT FLOOR, AND DISPLAY SHELVES. MUST REMOVE ALL FLIES, DROPPINGS, CLEAN AND SANITIZE ALL AFFECTED AREAS. CONTACT PEST CONTROL FOR SERVICE. FRONT DOOR NOT RODENT PROOF, APPROX 1/2 INCH GAP AT DOORS. INSTD TO RODENT PROOF SAME AND HAVE TIGHT FITTING. VIOLATION 7-38-020 SERIOUS. | 19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: OUTSIDE GARBAGE AREA NOT MAINTAINED. EXTERIOR OF GREASE INTERCEPTOR ENRUSTED WITH GREASE. MUST CLEAN AND MAINTAIN. VIOLATION 7-38-020 SERIOUS.          | 1. SOURCE SOUND CONDITION, NO SPOILAGE, FOODS PROPERLY LABELED, SHELLFISH TAGS IN PLACE - Comments: UNWHOLESOME, SPOILED  RAW MEAT PRODUCTS NOTED IN WALK IN COOLER, BEING OFFERED FOR SALE. LARGE SOLID BLOCK OF VARIETY OF MEATS (BEEF, PORK, CHICKEN CLUMPED TOGETHER) WITH FOUL SMELL,  BLACK, GREEN, AND GRAY IN COLOR. ALSO NOTED LIVE FLIES ON GROUND BEEF IN MEAT PREP AREA  WITH FOUL SMELL AND BROWN IN COLOR. VIOLATION 7-38-005B CRITICAL. APPROX 100LBS $500 VALUE. ALL PRODUCT DISCARDED AND DENATURED AT THIS TIME. | 17. POTENTIALLY HAZARDOUS FOOD PROPERLY THAWED - Comments: IMPROPER THAWING OF CHICKEN NOTED. CHICKEN IN STANDING WATER IN BASIN OF 3-COMPARTMENT SINK. INSTD ON PROPER THAWING TECHNIQUES. VIOLATION 7-38-005A SERIOUS. | 12. HAND WASHING FACILITIES: WITH SOAP AND SANITARY HAND DRYING DEVICES, CONVENIENT AND ACCESSIBLE TO FOOD PREP AREA - Comments: NO SOAP NOTED AT EXPOSED HANDSINK IN MEAT PREP AREA. MUST PROVIDE AT ALL TIMES. VIOLATION 7-38-030 CRITICAL.                                                                                              | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: THE FOLLOWING POTENTIALLY HAZARDOUS FOODS AT IMPROPER TEMPERATURES ON COUNTERTOP: GROUND SAUSAGE AT 60.8F, RAW CHICKEN AT 49.2F. ALL PRODUCT DISPOSED OF AND DENATURED AT THIS TIME. VIOLATION 7-38-005A CRITICAL. APPROX 30LBS, $100 VALUE. | 13. NO EVIDENCE OF RODENT OR INSECT INFESTATION, NO BIRDS, TURTLES OR OTHER ANIMALS - Comments: 2 LIVE KITTENS NOTED IN BASEMENT. LIVE ANIMALS ARE PROHIBITED ON SITE. VIOLATION 7-38-020 CRITICAL.                                                                                                                                                                           | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: ALL FOOD AND NON FOOD CONTACT EQUIPMENT NOT CLEAN, EXCESSIVE DEBRIS: INTERIOR/EXTERIOR OF ALL COOLERS/FREEZERS, MICROWAVE, OVEN, FRYERS, STORAGE SHELVES, MEAT DISPLAY CASE, PREP TABLES, MEAT SAW, MEAT GRINDER, BASINS OF ALL SINKS. INSTD TO CLEAN AND MAINTAIN SAME. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: WALK IN FREEZER ENCRUSTED WITH ICE THROUGH OUT. WALK IN COOLER CONDENSOR LINE IN POOR REPAIR, LEAKING. INSTD TO REPAIR SAME. CUTTING BOARDS PITTED, WITH DEEP, DARK GROOVES, WORN BEYOND REPAIR. INSTD TO REPLACE AND MAINTAIN CUTTING BOARDS.                                                   | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS THROUGH OUT NOT CLEAN, DEBRIS. INSTD TO CLEAN AND MAINTAIN AT ALL TIMES, | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: WALLS AND LIGHTSHIELDS THROUGH OUT NOT CLEAN, DEBRIS, DEAD FLIES. INSTD TO CLEAN AND MAINTAIN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: EXTEME CLUTTER IN ALL STORAGE AREAS AND BASEMENT. INSTD TO REMOVE CLUTTER AND ORGANIZE AREAS. | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: NO CHEMICAL TEST KIT ON SITE FOR SANITIZER FOR 3-COMPARTMENT SINK. VIOLATION 7-38-030 SERIOUS. |
   | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INTERIOR OF WALK IN COOLER NOT CLEAN OF DEBRIS. MUST CLEAN/MAINTAIN. ALSO LOWER DISPLAY SHELVES NOT CLEAN OF DEBRIS. MUST CLEAN/MAINTAIN.                                                                                                                                                                                                                                                                                                                                                                   | 42. APPROPRIATE METHOD OF HANDLING OF FOOD (ICE) HAIR RESTRAINTS AND CLEAN APPAREL WORN - Comments:  EMPLOYEES NOT WEARING  HAIR RESTRAINT IN FOOD PREP AREA.MUST PROVIDE.                                                                                                                                                                                                                                                                                                                                                                                                                                 | 45. FOOD HANDLER REQUIREMENTS MET - Comments: NO PROOF OF THE NEW FOOD HANDLERS TRAINING FOR EMPLOYEES. MUST PROVIDE FOR EMPLOYEES.                                                                                                                                | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: NO METAL STEM THERMOMETER FOR EMPLOYEES AND MISSING THERMOMETER INSIDE REACH IN COOLER BEHIND COUNTER. MUST PROVIDE.                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                                                                                                                      |                                                                                                                                                                                                                                                                                                                                                                               |                                                                                                                                                                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                                                                                   |                                                                                                                                                                                                       |                                                                                                                                                                                                                                     |                                                                                                                                                                                                             |                                                                                                                                                                                                               |
   | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: INSTRUCTED MANAGER TO ORGANIZE EXCESSIVE CLUTTER IN THE REAR STORAGE AREA TO PREVENT HARBORAGE.                                                                                                                                                                                                                                                                                                                                                                                               |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                                                                                                                      |                                                                                                                                                                                                                                                                                                                                                                               |                                                                                                                                                                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                                                                                   |                                                                                                                                                                                                       |                                                                                                                                                                                                                                     |                                                                                                                                                                                                             |                                                                                                                                                                                                               |
   | 24. DISH WASHING FACILITIES: PROPERLY DESIGNED, CONSTRUCTED, MAINTAINED, INSTALLED, LOCATED AND OPERATED - Comments: ALL COFFEE BREWING AND FROZEN DRINK MAKER/DISPENSER EQUIPMENT HAS BEEN REMOVED. BUSINESS SELLING ONLY PRE-PACKAGED BEVERAGES ONLY. NO THREE COMPARTMENT SINK REQUIRED AT THIS TIME.                                                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                            |                                                                                                                                                                                                                                                                                                                                                                      |                                                                                                                                                                                                                                                                                                                                                                               |                                                                                                                                                                                                                                                                                                                                                                          |                                                                                                                                                                                                                                                                                                                                                                                                   |                                                                                                                                                                                                       |                                                                                                                                                                                                                                     |                                                                                                                                                                                                             |                                                                                                                                                                                                               |
   :END:


   Note that this column is structured in the following form:

   - If there are several violations reported, those violations will
     be separated by ='|'=
   - Every violation begins with a code and  a description
   - Every violation could have *comments*, those comments appear after
     the string =- Comments:=

   We will take that observations in account and create a new table
   called =cleaned.violations= to store

   - inspection
   - violation_code
   - violation_description
   - violation_comments

   #+BEGIN_SRC sql :results table drawer :tangle ./src/create_violations_table.sql
     drop table if exists cleaned.violations cascade;

     create table cleaned.violations as (
     select
     inspection,
     license_num as entity_id, -- This is a requirement of triage
     date as knowledge_date,
     btrim(tuple[1]) as violation_code,
     btrim(tuple[2]) as violation_description,
     btrim(tuple[3]) as violation_comment from
     (
     select
     inspection,
     license_num,
     date,
     regexp_split_to_array(
     regexp_split_to_table(coalesce(violations, '.- Comments:'), '\|'),   -- We don't want to loose inspections
     '\.|- Comments:') as tuple
     from inspections
     where results in ('Fail', 'Pass', 'Pass w/ Conditions') and license_num is not null
     ) as t
     )
   #+END_SRC

   #+RESULTS:


#+BEGIN_SRC sql
  select count(*) from cleaned.violations
#+END_SRC

#+RESULTS:
:RESULTS:
|  count |
|--------|
| 577830 |
:END:

   This code is in =/code/create_violations_table.sql=, you can execute
   this as before.

   As we will see through all this tutorial, /data is always messy/, to
   begin with we have several different spellings (e.g. =SUBWAY= and
   =Subway=, =MCDONALDS= and =MC DONALD'S=, =DUNKIN DONUTS/BASKIN ROBBINS= and
   =DUNKIN DONUTS / BASKIN ROBBINS=, etc)

   We could try a very simple cleaning for example, convert all the
   names to uppercase, remove the trailing spaces, remove the apostrophe
   "='"= and remove the spaces around "=/=". The problem with this approach
   is that we will be fixing the names that we just saw, but there are
   several other nuances down that list. Another approach is use [[https://www.postgresql.org/docs/current/static/fuzzystrmatch.html][soundex]],
   but that will create a lot of mismatches. The real workaround is apply
   some /machine learning/ to /deduplicate/ the entities [fn:3].  We wont
   follow that path here.


   If we go back to the columns of the table, maybe there is another way
   to solve this: we could try with the column =license_num=  (assume that one
   license represents one establishment) and the column =address= (assume that one restaurant is
   in one place).


   #+BEGIN_SRC sql :results table drawer
     select
     count(distinct facility) as total_facilities,
     count(distinct license_num) as total_licenses,
     count(distinct address) as total_addresses
     from cleaned.inspections
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | total_facilities | total_licenses | total_addresses |
   |-----------------+---------------+----------------|
   |           20930 |         28054 |          15845 |
   :END:

   This doesn't look promising...

   /What are the top 5 locations with more inspections?/

   #+BEGIN_SRC sql :results table drawer
     select
     address, count(*) as total_inspections,
     coalesce(
     sum(
     case
     when results = 'Fail' then 1
     else 0
     end),0) as total_failures
     from cleaned.inspections
     group by address
     order by total_inspections desc
     limit 5;
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | address           | total_inspections | total_failures |
   |-------------------+------------------+---------------|
   | 11601 W TOUHY AVE |             1764 |           243 |
   | 5700 S CICERO AVE |              356 |            54 |
   | 500 W MADISON ST  |              317 |            65 |
   | 324 N LEAVITT ST  |              282 |            78 |
   | 333 W 35TH ST     |              237 |            33 |
   :END:

   The /location hypothesis/ also has problems, in particular could be *more*
   than one establishment per location (the first row is *O'Hare International Airport*)

   So, our last hope is the /license number/

   We could get, even more information if we check /How many of those inspections result in a 'Fail'/?

   /What are the top 5 licenses with more inspections?/

   #+BEGIN_SRC sql :results table drawer
     select
     license_num, count(*) as total_inspections,
     coalesce(
     sum(
     case
     when results = 'Fail' then 1
     else 0
     end),0) as total_failures
     from cleaned.inspections
     group by license_num
     order by total_inspections desc
     limit 5;
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | license_num | total_inspections | total_failures |
   |------------+------------------+---------------|
   |          0 |              377 |           116 |
   |      14616 |              172 |            30 |
   |    1354323 |              130 |             1 |
   |    1574001 |               78 |             4 |
   |    1974745 |               57 |             3 |
   :END:


   Even this column has some problems, let's investigate a little about
   the =license_num= = =0=.

   #+BEGIN_SRC sql :results table drawer
     select
     facility_type, count(*) as total_inspections,
     coalesce(
     sum(
     case
     when results = 'Fail' then 1
     else 0
     end),0) as total_failures
     from cleaned.inspections
     where license_num=0
     group by  facility_type
     order by total_inspections desc
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | facility_type                | total_inspections | total_failures |
   |-----------------------------+------------------+---------------|
   | Restaurant                  |               73 |            40 |
   | Special Event               |               68 |            10 |
   | Shelter                     |               30 |             6 |
   | Navy Pier Kiosk             |               29 |             4 |
   | CHURCH                      |               24 |             3 |
   | [NULL]                      |               24 |            10 |
   | Grocery Store               |               15 |             7 |
   | CHURCH KITCHEN              |               12 |             5 |
   | PRIVATE SCHOOL              |               10 |             1 |
   | CHURCH/SPECIAL EVENTS       |               10 |             2 |
   | Church                      |                8 |             1 |
   | Long Term Care              |                8 |             1 |
   | AFTER SCHOOL PROGRAM        |                8 |             1 |
   | Catering                    |                6 |             3 |
   | Mobile Food Dispenser       |                5 |             2 |
   | Illegal Vendor              |                3 |             3 |
   | School                      |                3 |             0 |
   | NOT FOR PROFIT              |                2 |             2 |
   | BOYS AND GIRLS CLUB         |                2 |             0 |
   | CHURCH/SPECIAL EVENT        |                2 |             0 |
   | FOOD PANTRY/CHURCH          |                2 |             0 |
   | HERBAL LIFE SHOP            |                2 |             1 |
   | Hospital                    |                2 |             0 |
   | NON -PROFIT                 |                2 |             0 |
   | Social Club                 |                2 |             2 |
   | SOUP KITCHEN                |                2 |             1 |
   | SUMMER FEEDING              |                2 |             0 |
   | SUMMER FEEDING PREP AREA    |                2 |             1 |
   | AFTER SCHOOL CARE           |                1 |             0 |
   | NP-KIOSK                    |                1 |             0 |
   | FOOD PANTRY                 |                1 |             0 |
   | religious                   |                1 |             1 |
   | Food Pantry                 |                1 |             0 |
   | RESTAURANT/GROCERY          |                1 |             1 |
   | RETAIL                      |                1 |             1 |
   | FARMER'S MARKET             |                1 |             1 |
   | Daycare (2 - 6 Years)       |                1 |             0 |
   | UNLICENSED FACILITY         |                1 |             1 |
   | SOCIAL CLUB                 |                1 |             1 |
   | WAREHOUSE                   |                1 |             0 |
   | CHICAGO PARK DISTRICT       |                1 |             0 |
   | Wholesale                   |                1 |             1 |
   | KIDS CAFE                   |                1 |             1 |
   | incubator                   |                1 |             0 |
   | NEWSSTAND                   |                1 |             1 |
   | NON-FOR PROFIT BASEMENT KIT |                1 |             0 |
   | Bakery                      |                1 |             1 |
   :END:

   Most of these are related to /special events/, /churchs/, /festivals/
   etc. We could research deeply the =restaurants= which have =license_num= =
   =0=, but we will skip that for the moment.


   Finally, we can conclude that, except for some details, =license_num= is
   the way to go, for the identification of the establishments.


   #+BEGIN_SRC sql :results table drawer
     select
     license_num, facility, address,
     count(*) as total_inspections,
     coalesce(
     sum(
     case
     when results = 'Fail' then 1
     else 0
     end),0) as total_failures
     from cleaned.inspections
     group by license_num, facility, address
     order by count(*)  desc
     limit 5;
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | license_num | facility                          | address                 | total_inspections | total_failures |
   |------------+-----------------------------------+-------------------------+------------------+---------------|
   |    1354323 | SPORTSERVICE SOLDIER FIELD        | 1410 S MUSEUM CAMPUS DR |              119 |             1 |
   |      14616 | ILLINOIS SPORTSERVICE INC         | 333 W 35TH ST           |               99 |            19 |
   |    1574001 | LEVY RESTAURANTS AT WRIGLEY FIELD | 1060 W ADDISON ST       |               68 |             1 |
   |    1974745 | THE UNITED CENTER                 | 1901 W MADISON ST       |               46 |             0 |
   |    1490035 | MCDONALD'S                        | 6900 S LAFAYETTE AVE    |               45 |             6 |
   :END:


** Exploring the data

   /Which is the spatial distribution of inspections?/


   #+BEGIN_SRC sql :results table drawer
     select
     zip_code,
     count(*) as total_inspections,
     coalesce(
     sum(
     case
     when results = 'Fail' then 1
     else 0
     end),0) as total_failures
     from cleaned.inspections
     group by zip_code
     order by total_inspections desc;
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | zip_code | total_inspections | total_failures |
   |---------+------------------+---------------|
   |   60614 |             4823 |          1154 |
   |   60647 |             4587 |          1006 |
   |   60611 |             4541 |           776 |
   |   60657 |             4373 |          1012 |
   |   60622 |             4278 |          1109 |
   |   60618 |             3988 |           704 |
   |   60608 |             3907 |           942 |
   |   60625 |             3512 |           808 |
   |   60639 |             3454 |           828 |
   |   60607 |             3414 |           741 |
   |   60640 |             3386 |           889 |
   |   60632 |             3358 |           764 |
   |   60616 |             3286 |           759 |
   |   60623 |             3260 |           831 |
   |   60609 |             2998 |           661 |
   |   60654 |             2990 |           502 |
   |   60613 |             2810 |           558 |
   |   60619 |             2765 |           828 |
   |   60659 |             2756 |           698 |
   |   60617 |             2715 |           578 |
   |   60610 |             2660 |           577 |
   |   60634 |             2651 |           466 |
   |   60641 |             2539 |           483 |
   |   60629 |             2530 |           472 |
   |   60620 |             2498 |           626 |
   |   60628 |             2462 |           684 |
   |   60601 |             2425 |           343 |
   |   60606 |             2336 |           323 |
   |   60605 |             2140 |           345 |
   |   60612 |             2109 |           466 |
   |   60626 |             2069 |           529 |
   |   60651 |             1973 |           586 |
   |   60660 |             1955 |           461 |
   |   60643 |             1917 |           415 |
   |   60661 |             1900 |           335 |
   |   60630 |             1847 |           380 |
   |   60638 |             1788 |           271 |
   |   60666 |             1787 |           248 |
   |   60644 |             1739 |           491 |
   |   60637 |             1718 |           512 |
   |   60636 |             1715 |           496 |
   |   60649 |             1692 |           432 |
   |   60615 |             1675 |           512 |
   |   60642 |             1507 |           353 |
   |   60624 |             1475 |           382 |
   |   60603 |             1377 |           203 |
   |   60653 |             1223 |           320 |
   |   60652 |             1202 |           188 |
   |   60621 |             1152 |           273 |
   |   60602 |             1044 |           170 |
   |   60646 |             1022 |           180 |
   |   60631 |             1017 |           218 |
   |   60645 |              948 |           254 |
   |   60604 |              938 |           131 |
   |   60707 |              714 |           154 |
   |   60656 |              564 |           118 |
   |   60655 |              551 |            90 |
   |   60633 |              233 |            62 |
   |   60827 |               97 |            21 |
   |  [NULL] |               77 |            24 |
   |   60193 |               14 |             3 |
   |   60153 |               13 |             3 |
   |   60007 |               12 |             3 |
   |   60804 |                6 |             1 |
   |   60482 |                5 |             4 |
   |   60126 |                5 |             1 |
   |   60077 |                4 |             1 |
   |   60201 |                4 |             3 |
   |   60409 |                4 |             1 |
   |   60302 |                4 |             0 |
   |   60501 |                4 |             3 |
   |   60429 |                3 |             1 |
   |   60176 |                3 |             0 |
   |   60803 |                3 |             1 |
   |   60714 |                3 |             0 |
   |   60076 |                2 |             1 |
   |   60540 |                2 |             0 |
   |   60461 |                2 |             0 |
   |   60107 |                2 |             0 |
   |   60411 |                2 |             0 |
   |   60406 |                2 |             0 |
   |   60015 |                2 |             0 |
   |   60402 |                2 |             1 |
   |   60018 |                1 |             0 |
   |   60478 |                1 |             0 |
   |   60805 |                1 |             1 |
   |   60022 |                1 |             0 |
   |   60706 |                1 |             0 |
   |   60202 |                1 |             0 |
   |   60627 |                1 |             0 |
   |   60423 |                1 |             0 |
   |   60477 |                1 |             0 |
   |   60047 |                1 |             0 |
   |   60155 |                1 |             0 |
   |   60044 |                1 |             0 |
   |   60440 |                1 |             0 |
   |   60108 |                1 |             0 |
   |   60458 |                1 |             0 |
   |   60148 |                1 |             0 |
   |   60453 |                1 |             0 |
   :END:

   /Which is the temporal distribution of the inspections?/

   #+BEGIN_SRC sql :results table drawer
     select
     year, month,
     count(*) as total_inspections,
     coalesce(
     sum(
     case
     when results = 'Fail' then 1
     else 0
     end
     ),0) as total_failures
     from cleaned.inspections
     group by year, month
     order by year asc, month asc;
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | year | month | total_inspections | total_failures |
   |------+-------+------------------+---------------|
   | 2010 |     1 |             1279 |           330 |
   | 2010 |     2 |             1398 |           342 |
   | 2010 |     3 |             1478 |           350 |
   | 2010 |     4 |             1439 |           401 |
   | 2010 |     5 |             1541 |           389 |
   | 2010 |     6 |             1754 |           455 |
   | 2010 |     7 |             1276 |           367 |
   | 2010 |     8 |             1541 |           407 |
   | 2010 |     9 |             1640 |           427 |
   | 2010 |    10 |             1649 |           437 |
   | 2010 |    11 |             1201 |           308 |
   | 2010 |    12 |             1186 |           291 |
   | 2011 |     1 |             1260 |           288 |
   | 2011 |     2 |             1272 |           255 |
   | 2011 |     3 |             1693 |           380 |
   | 2011 |     4 |             1421 |           345 |
   | 2011 |     5 |             1645 |           362 |
   | 2011 |     6 |             1681 |           419 |
   | 2011 |     7 |             1311 |           346 |
   | 2011 |     8 |             1548 |           442 |
   | 2011 |     9 |             1481 |           417 |
   | 2011 |    10 |             1494 |           397 |
   | 2011 |    11 |             1552 |           396 |
   | 2011 |    12 |             1228 |           310 |
   | 2012 |     1 |             1290 |           302 |
   | 2012 |     2 |             1166 |           260 |
   | 2012 |     3 |             1341 |           303 |
   | 2012 |     4 |             1288 |           301 |
   | 2012 |     5 |             1683 |           382 |
   | 2012 |     6 |             1375 |           312 |
   | 2012 |     7 |             1228 |           310 |
   | 2012 |     8 |             1451 |           364 |
   | 2012 |     9 |             1406 |           324 |
   | 2012 |    10 |             1421 |           322 |
   | 2012 |    11 |             1347 |           274 |
   | 2012 |    12 |             1022 |           188 |
   | 2013 |     1 |             1426 |           261 |
   | 2013 |     2 |             1281 |           260 |
   | 2013 |     3 |             1407 |           269 |
   | 2013 |     4 |             1542 |           288 |
   | 2013 |     5 |             1692 |           331 |
   | 2013 |     6 |             1336 |           271 |
   | 2013 |     7 |             1307 |           274 |
   | 2013 |     8 |             1440 |           297 |
   | 2013 |     9 |             1628 |           375 |
   | 2013 |    10 |             1596 |           287 |
   | 2013 |    11 |             1265 |           235 |
   | 2013 |    12 |             1147 |           201 |
   | 2014 |     1 |             1228 |           231 |
   | 2014 |     2 |             1285 |           262 |
   | 2014 |     3 |             1464 |           258 |
   | 2014 |     4 |             1675 |           325 |
   | 2014 |     5 |             1707 |           336 |
   | 2014 |     6 |             1635 |           331 |
   | 2014 |     7 |             1522 |           345 |
   | 2014 |     8 |             1756 |           379 |
   | 2014 |     9 |             1761 |           380 |
   | 2014 |    10 |             1843 |           371 |
   | 2014 |    11 |             1353 |           278 |
   | 2014 |    12 |             1392 |           223 |
   | 2015 |     1 |             1429 |           301 |
   | 2015 |     2 |             1229 |           267 |
   | 2015 |     3 |             1525 |           330 |
   | 2015 |     4 |             1426 |           285 |
   | 2015 |     5 |             1455 |           292 |
   | 2015 |     6 |             1600 |           303 |
   | 2015 |     7 |             1400 |           295 |
   | 2015 |     8 |             1580 |           336 |
   | 2015 |     9 |             1676 |           322 |
   | 2015 |    10 |             1755 |           344 |
   | 2015 |    11 |             1479 |           280 |
   | 2015 |    12 |             1338 |           252 |
   | 2016 |     1 |             1411 |           298 |
   | 2016 |     2 |             1297 |           307 |
   | 2016 |     3 |             1944 |           402 |
   | 2016 |     4 |             1711 |           372 |
   | 2016 |     5 |             1780 |           379 |
   | 2016 |     6 |             1950 |           438 |
   | 2016 |     7 |             1373 |           309 |
   | 2016 |     8 |             1868 |           435 |
   | 2016 |     9 |             1914 |           420 |
   | 2016 |    10 |             1695 |           369 |
   | 2016 |    11 |             1537 |           319 |
   | 2016 |    12 |             1380 |           250 |
   | 2017 |     1 |             1560 |           325 |
   | 2017 |     2 |             1398 |           321 |
   | 2017 |     3 |             1835 |           412 |
   | 2017 |     4 |             1445 |           349 |
   | 2017 |     5 |             1476 |           321 |
   | 2017 |     6 |             1352 |           274 |
   | 2017 |     7 |              733 |           192 |
   | 2017 |     8 |              362 |           100 |
   :END:

   The number of inspections per month, is stable.

   #+BEGIN_SRC sql :results table drawer
     select
     violation_code,
     violation_description,
     count(*) as total
     from cleaned.violations
     group by violation_code, violation_description
     order by total desc
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | violation_code | violation_description                                                                                                                   | total |
   |---------------+----------------------------------------------------------------------------------------------------------------------------------------+-------|
   |            34 | FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED                                  | 74374 |
   |            35 | WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS                   | 66004 |
   |            33 | FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS                                                        | 65672 |
   |            38 | VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED                                                | 56340 |
   |            32 | FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED                                                       | 55625 |
   |            41 | PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED                                          | 35665 |
   |            18 | NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS | 27965 |
   |            36 | LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED                                                           | 27262 |
   |            40 | REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS                                                                     | 16759 |
   |            30 | FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED                                                       | 16468 |
   |            31 | CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES                              | 10516 |
   |            21 | * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED                                             | 10492 |
   |            29 | PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090                                                                                         |  9365 |
   |            43 | FOOD (ICE) DISPENSING UTENSILS, WASH CLOTHS PROPERLY STORED                                                                            |  8647 |
   |            37 | TOILET ROOM DOORS SELF CLOSING: DRESSING ROOMS WITH LOCKERS PROVIDED: COMPLETE SEPARATION FROM LIVING/SLEEPING QUARTERS                |  8138 |
   |             3 | POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE                               |  8057 |
   |             2 | FACILITIES TO MAINTAIN PROPER TEMPERATURE                                                                                              |  7556 |
   |            42 | APPROPRIATE METHOD OF HANDLING OF FOOD (ICE) HAIR RESTRAINTS AND CLEAN APPAREL WORN                                                    |  6895 |
   |            19 | OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED                                             |  6751 |
   |            16 | FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION                                                        |  6682 |
   |            45 | FOOD HANDLER REQUIREMENTS MET                                                                                                          |  6662 |
   |            24 | DISH WASHING FACILITIES: PROPERLY DESIGNED, CONSTRUCTED, MAINTAINED, INSTALLED, LOCATED AND OPERATED                                   |  5202 |
   |            11 | ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED                                                                      |  4761 |
   |            12 | HAND WASHING FACILITIES: WITH SOAP AND SANITARY HAND DRYING DEVICES, CONVENIENT AND ACCESSIBLE TO FOOD PREP AREA                       |  3247 |
   |             8 | SANITIZING RINSE FOR EQUIPMENT AND UTENSILS:  CLEAN, PROPER TEMPERATURE, CONCENTRATION, EXPOSURE TIME                                  |  2973 |
   |             9 | WATER SOURCE: SAFE, HOT & COLD UNDER CITY PRESSURE                                                                                     |  2454 |
   |            26 | ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, PROPERLY DESIGNED AND INSTALLED                                                               |  2366 |
   |            14 | PREVIOUS SERIOUS VIOLATION CORRECTED, 7-42-090                                                                                         |  1891 |
   |             6 | HANDS WASHED AND CLEANED, GOOD HYGIENIC PRACTICES; NO BARE HAND CONTACT WITH READY-TO-EAT FOODS                                        |  1573 |
   |            22 | DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK                                         |  1473 |
   |            28 | * INSPECTION REPORT SUMMARY DISPLAYED AND VISIBLE TO ALL CUSTOMERS                                                                     |  1345 |
   |            10 | SEWAGE AND WASTE WATER DISPOSAL, NO BACK SIPHONAGE, CROSS  CONNECTION AND/OR BACK FLOW                                                 |  1228 |
   |            13 | NO EVIDENCE OF RODENT OR INSECT INFESTATION, NO BIRDS, TURTLES OR OTHER ANIMALS                                                        |   829 |
   |            70 | NO SMOKING REGULATIONS                                                                                                                 |   781 |
   |            39 | LINEN: CLEAN AND SOILED PROPERLY STORED                                                                                                |   693 |
   |             1 | SOURCE SOUND CONDITION, NO SPOILAGE, FOODS PROPERLY LABELED, SHELLFISH TAGS IN PLACE                                                   |   655 |
   |             4 | SOURCE OF CROSS CONTAMINATION CONTROLLED I                                                                                             |   602 |
   |            27 | TOILET ROOMS ENCLOSED CLEAN, PROVIDED WITH HAND CLEANSER, SANITARY HAND DRYING DEVICES AND PROPER WASTE RECEPTACLES                    |   554 |
   |            44 | ONLY AUTHORIZED PERSONNEL IN THE FOOD-PREP AREA                                                                                        |   434 |
   |            25 | TOXIC ITEMS PROPERLY STORED, LABELED AND USED                                                                                          |   233 |
   |            20 | INSIDE CONTAINERS OR RECEPTACLES: ADEQUATE NUMBER, PROPERLY COVERED AND INSECT/RODENT PROOF                                            |   180 |
   |             7 | WASH AND RINSE WATER: CLEAN AND PROPER TEMPERATURE                                                                                     |   159 |
   |            17 | POTENTIALLY HAZARDOUS FOOD PROPERLY THAWED                                                                                             |   112 |
   |             5 | PERSONNEL WITH INFECTIONS RESTRICTED: NO OPEN SORES, WOUNDS, ETC                                                                       |    15 |
   |            15 | UNWRAPPED AND POTENTIALLY HAZARDOUS FOOD NOT RE-SERVED                                                                                 |     4 |
   |            23 | DISHES AND UTENSILS FLUSHED, SCRAPED, SOAKED                                                                                           |     3 |
   :END:

   This looks weird, the top most "violation" is not an actual
   violation. We will repeat the query, we will group by the =results=

   #+BEGIN_SRC sql :results table drawer

     with inspections_violations as (
     select
     i.inspection, i.results,
     v.violation_code
     from cleaned.inspections as i inner join cleaned.violations as v
     using(inspection)
     )


     select violation_code, results,
     --grouping(violation_code, results),
     count(violation_code)
     from inspections_violations
     group by rollup(violation_code, results)
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   | violation_code | results            |  count |
   |---------------+--------------------+--------|
   |             1 | Fail               |    328 |
   |             1 | Pass               |     57 |
   |             1 | Pass w/ Conditions |    270 |
   |             1 | [NULL]             |    655 |
   |            10 | Fail               |    719 |
   |            10 | Pass               |    352 |
   |            10 | Pass w/ Conditions |    157 |
   |            10 | [NULL]             |   1228 |
   |            11 | Fail               |   2567 |
   |            11 | Pass               |   1539 |
   |            11 | Pass w/ Conditions |    655 |
   |            11 | [NULL]             |   4761 |
   |            12 | Fail               |   1719 |
   |            12 | Pass               |    590 |
   |            12 | Pass w/ Conditions |    938 |
   |            12 | [NULL]             |   3247 |
   |            13 | Fail               |    539 |
   |            13 | Pass               |    258 |
   |            13 | Pass w/ Conditions |     32 |
   |            13 | [NULL]             |    829 |
   |            14 | Fail               |    736 |
   |            14 | Pass               |    513 |
   |            14 | Pass w/ Conditions |    642 |
   |            14 | [NULL]             |   1891 |
   |            15 | Pass               |      3 |
   |            15 | Pass w/ Conditions |      1 |
   |            15 | [NULL]             |      4 |
   |            16 | Fail               |   3188 |
   |            16 | Pass               |   2128 |
   |            16 | Pass w/ Conditions |   1366 |
   |            16 | [NULL]             |   6682 |
   |            17 | Fail               |     52 |
   |            17 | Pass               |      5 |
   |            17 | Pass w/ Conditions |     55 |
   |            17 | [NULL]             |    112 |
   |            18 | Fail               |  15180 |
   |            18 | Pass               |  11851 |
   |            18 | Pass w/ Conditions |    934 |
   |            18 | [NULL]             |  27965 |
   |            19 | Fail               |   3602 |
   |            19 | Pass               |   2676 |
   |            19 | Pass w/ Conditions |    473 |
   |            19 | [NULL]             |   6751 |
   |             2 | Fail               |   3349 |
   |             2 | Pass               |   1746 |
   |             2 | Pass w/ Conditions |   2461 |
   |             2 | [NULL]             |   7556 |
   |            20 | Fail               |    105 |
   |            20 | Pass               |     64 |
   |            20 | Pass w/ Conditions |     11 |
   |            20 | [NULL]             |    180 |
   |            21 | Fail               |   3730 |
   |            21 | Pass               |   2055 |
   |            21 | Pass w/ Conditions |   4707 |
   |            21 | [NULL]             |  10492 |
   |            22 | Fail               |    775 |
   |            22 | Pass               |    590 |
   |            22 | Pass w/ Conditions |    108 |
   |            22 | [NULL]             |   1473 |
   |            23 | Fail               |      2 |
   |            23 | Pass               |      1 |
   |            23 | [NULL]             |      3 |
   |            24 | Fail               |   2838 |
   |            24 | Pass               |   2091 |
   |            24 | Pass w/ Conditions |    273 |
   |            24 | [NULL]             |   5202 |
   |            25 | Fail               |    118 |
   |            25 | Pass               |     59 |
   |            25 | Pass w/ Conditions |     56 |
   |            25 | [NULL]             |    233 |
   |            26 | Fail               |   1287 |
   |            26 | Pass               |    933 |
   |            26 | Pass w/ Conditions |    146 |
   |            26 | [NULL]             |   2366 |
   |            27 | Fail               |    271 |
   |            27 | Pass               |    184 |
   |            27 | Pass w/ Conditions |     99 |
   |            27 | [NULL]             |    554 |
   |            28 | Fail               |    544 |
   |            28 | Pass               |    108 |
   |            28 | Pass w/ Conditions |    693 |
   |            28 | [NULL]             |   1345 |
   |            29 | Fail               |   4903 |
   |            29 | Pass               |   3803 |
   |            29 | Pass w/ Conditions |    659 |
   |            29 | [NULL]             |   9365 |
   |             3 | Fail               |   3158 |
   |             3 | Pass               |    228 |
   |             3 | Pass w/ Conditions |   4671 |
   |             3 | [NULL]             |   8057 |
   |            30 | Fail               |   3728 |
   |            30 | Pass               |  10336 |
   |            30 | Pass w/ Conditions |   2404 |
   |            30 | [NULL]             |  16468 |
   |            31 | Fail               |   2472 |
   |            31 | Pass               |   6475 |
   |            31 | Pass w/ Conditions |   1569 |
   |            31 | [NULL]             |  10516 |
   |            32 | Fail               |  13770 |
   |            32 | Pass               |  35137 |
   |            32 | Pass w/ Conditions |   6718 |
   |            32 | [NULL]             |  55625 |
   |            33 | Fail               |  15052 |
   |            33 | Pass               |  42749 |
   |            33 | Pass w/ Conditions |   7871 |
   |            33 | [NULL]             |  65672 |
   |            34 | Fail               |  17713 |
   |            34 | Pass               |  48297 |
   |            34 | Pass w/ Conditions |   8364 |
   |            34 | [NULL]             |  74374 |
   |            35 | Fail               |  16583 |
   |            35 | Pass               |  42261 |
   |            35 | Pass w/ Conditions |   7160 |
   |            35 | [NULL]             |  66004 |
   |            36 | Fail               |   7232 |
   |            36 | Pass               |  17103 |
   |            36 | Pass w/ Conditions |   2927 |
   |            36 | [NULL]             |  27262 |
   |            37 | Fail               |   2587 |
   |            37 | Pass               |   4799 |
   |            37 | Pass w/ Conditions |    752 |
   |            37 | [NULL]             |   8138 |
   |            38 | Fail               |  14351 |
   |            38 | Pass               |  35876 |
   |            38 | Pass w/ Conditions |   6113 |
   |            38 | [NULL]             |  56340 |
   |            39 | Fail               |    205 |
   |            39 | Pass               |    411 |
   |            39 | Pass w/ Conditions |     77 |
   |            39 | [NULL]             |    693 |
   |             4 | Fail               |    241 |
   |             4 | Pass               |     97 |
   |             4 | Pass w/ Conditions |    264 |
   |             4 | [NULL]             |    602 |
   |            40 | Fail               |   4423 |
   |            40 | Pass               |  10133 |
   |            40 | Pass w/ Conditions |   2203 |
   |            40 | [NULL]             |  16759 |
   |            41 | Fail               |   9844 |
   |            41 | Pass               |  21939 |
   |            41 | Pass w/ Conditions |   3882 |
   |            41 | [NULL]             |  35665 |
   |            42 | Fail               |   1552 |
   |            42 | Pass               |   4028 |
   |            42 | Pass w/ Conditions |   1315 |
   |            42 | [NULL]             |   6895 |
   |            43 | Fail               |   2026 |
   |            43 | Pass               |   5155 |
   |            43 | Pass w/ Conditions |   1466 |
   |            43 | [NULL]             |   8647 |
   |            44 | Fail               |    126 |
   |            44 | Pass               |    244 |
   |            44 | Pass w/ Conditions |     64 |
   |            44 | [NULL]             |    434 |
   |            45 | Fail               |   1556 |
   |            45 | Pass               |   4012 |
   |            45 | Pass w/ Conditions |   1094 |
   |            45 | [NULL]             |   6662 |
   |             5 | Fail               |      9 |
   |             5 | Pass w/ Conditions |      6 |
   |             5 | [NULL]             |     15 |
   |             6 | Fail               |    669 |
   |             6 | Pass               |     49 |
   |             6 | Pass w/ Conditions |    855 |
   |             6 | [NULL]             |   1573 |
   |             7 | Fail               |     76 |
   |             7 | Pass               |     32 |
   |             7 | Pass w/ Conditions |     51 |
   |             7 | [NULL]             |    159 |
   |            70 | Fail               |    412 |
   |            70 | Pass               |    188 |
   |            70 | Pass w/ Conditions |    181 |
   |            70 | [NULL]             |    781 |
   |             8 | Fail               |   1231 |
   |             8 | Pass               |    573 |
   |             8 | Pass w/ Conditions |   1169 |
   |             8 | [NULL]             |   2973 |
   |             9 | Fail               |   1356 |
   |             9 | Pass               |    809 |
   |             9 | Pass w/ Conditions |    289 |
   |             9 | [NULL]             |   2454 |
   |        [NULL] | [NULL]             | 565662 |
   :END:


   *NOTE*: You could also split between, /major violation found/ and /minor violation found/,
   but we will keep this simple for the moment.



   /How often change the risk in a facility?/

   #+BEGIN_SRC sql
     select
     license_num, risk || '->' || previous_risk, count(*)
     from
     (
     select date, license_num,risk, lag(risk) over w as previous_risk
     from cleaned.inspections
     window w as (partition by license_num order by date asc)
     ) as t
     where (risk <>  previous_risk) and license_num != '0'
     group by license_num, risk || '->' || previous_risk
     order by  count(*) desc, license_num
     limit 10
   #+END_SRC

   #+RESULTS:
   | license_num | ?column?     | count |
   |------------+--------------+-------|
   |    1574001 | High->Medium |     9 |
   |      20481 | Medium->High |     8 |
   |      20481 | High->Medium |     8 |
   |    1574001 | Medium->High |     8 |
   |      14616 | Medium->Low  |     7 |
   |      14616 | Low->Medium  |     7 |
   |      51011 | High->Medium |     7 |
   |      23041 | Medium->High |     6 |
   |      23041 | High->Medium |     6 |
   |      23051 | Medium->High |     6 |
